USER_AGENT = (
    "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) "
    "Chrome/127.0.0.0 Safari/537.36"
)
POSTKZ_API_URL = "https://post.kz/mail-app/api/checkIinBin"
GBDFL_URL = (
    "https://www.nitec.kz/ru/proekty/gosudarstvennaya-baza-dannykh-fizicheskie-lica"
)
NCA_URL = "https://nca.pki.gov.kz/service/pkiorder/create.xhtml?lang=ru&certtemplateAlias=individ_ng"
FAFA_URL = "https://fa-fa.kz/company_info/"
POSTKZ_URL = "https://post.kz/register"
DONATE_URL = "https://pay.cloudtips.ru/p/9d2b07f7"
DATE_REQUEST = "Отправьте текстом дату рождения\n(в формате ГГГГ-ММ-ДД)\nНапример: <i>1997-08-25</i>"
NOT_FOUND_TEXT = (
    "❌ <b>Подходящий ИИН не найден!</b>\n\n"
    "Убедитесь, что вы верно ввели данные и повторите поиск позже.\n\n"
)
DEEP_SEARCH_TEXT = (
    "Если вы ищете относительно старый ИИН (выданный в 2022 году "
    "или ранее), тогда для более глубокого поиска можете нажать "
    'кнопку "Искать среди более старых ИИН".\n\n'
    "Если вы ищете ИИН, присвоенный недавно, то нажимать эту "
    "кнопку не имеет смысла."
)
RTF_DOCX_CAPTION = (
    "Все данные продублируйте на казахской и русской половинках документа:\n"
    "- номер свидетельства укажите любой (это неважно);\n"
    "- укажите ваш номер ИИН;\n"
    "- укажите ваши ФИО (везде по-русски);\n"
    "- укажите вашу дату рождения;\n"
    "- укажите ваше место рождения (везде по-русски, страна рождения - по "
    "современному названию страны, город/регион - как указано в загран. "
    'паспорте, но без обозначения "ОБЛ.", "ГОР.", "Г." и т.п.);\n'
    "- укажите дату выдачи (любую от даты присвоения ИИН до текущего дня).\n\n"
    "🖨️ Распечатайте отредактированный документ на одной стороне листа А4 "
    "с альбомной (горизонтальной) ориентацией страницы."
)
SEARCH_LOG_DB_FILE = "search_log.db"